# ViewName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImageExportOptions..::..ViewName Property
ImageExportOptions Class See Also
---
The name of the view to be created.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public string ViewName { get; set; }
```

Visual Basic
---
```text
Public Property ViewName As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ ViewName {
	String^ get ();
	void set (String^ value);
}
```

# Remarks
This field is used only to save an image to a project as a new view.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ImageExportOptions Class
Autodesk.Revit.DB Namespace